In [74]:
import pandas as pd
# Python3 code here creating class 
class olist: 
	def __init__(self, name, roll): 
		self.name = name 
		self.roll = roll 

# creating list	 
listt = [] 


# appending instances to list 
listt.append( olist('Muneer', 2) ) 
listt.append( olist('Ali', 40) ) 
listt.append( olist('Nawaz', 44) ) 
listt.append( olist('Ayaz', 44) ) 

clist=[] #for changing the list of object to list
for obj in listt: 
  clist.append([obj.name,obj.roll])


  # c+=1
# We can also access instances attributes 
# as list[0].name, list[0].roll and so on.

df = pd.DataFrame(clist, columns=["Name", "Roll Number"])
df

     Name  Roll Number
0  Muneer            2
1     Ali           40
2   Nawaz           44
3    Ayaz           44